#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.2`
* Working Directory 📂`./code/data-management-zone`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mazurerm_resource_group.consumption_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg][0m
[0m[1mazurerm_resource_group.governance_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg][0m
[0m[1mazurerm_resource_group.container_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mazurerm_resource_group.automation_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-automation-rg][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.unity_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001][0m
[0m[1mazurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-automation-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mydmgmt-dev-uai001][0m
[0m[1mazurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001][0m
[0m[1mazurerm_purview_account.purview: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001][0m
[0m[1mazurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-dbac001][0m
[0m[1mazurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001][0m
[0m[1mazurerm_synapse_private_link_hub.synapse_pl_hub: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001][0m
[0m[1mazapi_resource.private_endpoint_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet][0m
[0m[1mdata.azapi_resource.purview: Reading...[0m[0m
[0m[1mazurerm_role_assignment.user_assigned_identity_roleassignment_governance_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001/providers/Microsoft.Authorization/roleAssignments/89f6af3e-8a53-efd9-637b-399011ac936f][0m
[0m[1mazurerm_role_assignment.purview_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001/providers/Microsoft.Authorization/roleAssignments/ae3cc160-292e-2d1f-a7b0-d6722db8fb2c][0m
[0m[1mdata.azapi_resource.purview: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001][0m
[0m[1mazapi_resource.databricks_private_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet][0m
[0m[1mazurerm_private_endpoint.purview_private_endpoint_portal: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-portal-pe][0m
[0m[1mazurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevacr001-pe][0m
[0m[1mazurerm_private_endpoint.purview_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-blob][0m
[0m[1mazurerm_private_endpoint.purview_private_endpoint_namespace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-namespace][0m
[0m[1mazurerm_private_endpoint.purview_private_endpoint_queue: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-queue][0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv001-pe][0m
[0m[1mazurerm_private_endpoint.purview_private_endpoint_account: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-account-pe][0m
[0m[1mazurerm_private_endpoint.synapse_pl_hub_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-pe][0m
[0m[1mazapi_resource.databricks_public_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet][0m
[0m[1mazurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001][0m
[0m[1mazurerm_private_endpoint.databricks_private_endpoint_web: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-web-pe][0m
[0m[1mazurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-uiapi-pe][0m
[0m[1mazurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-blob-pe][0m
[0m[1mazurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/managementPolicies/default][0m
[0m[1mazurerm_role_assignment.databricks_access_connector_roleassignment_datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/providers/Microsoft.Authorization/roleAssignments/db455db8-d5d3-2b43-c364-dd4bcdfe2e07][0m
[0m[1mazurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-dfs-pe][0m
[0m[1mazapi_resource.datalake_container_unity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/blobServices/default/containers/unitynortheurope][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # databricks_metastore.metastore[0m will be created
[0m  [32m+[0m[0m resource "databricks_metastore" "metastore" {
      [32m+[0m[0m cloud                                             = (known after apply)
      [32m+[0m[0m created_at                                        = (known after apply)
      [32m+[0m[0m created_by                                        = (known after apply)
      [32m+[0m[0m delta_sharing_organization_name                   = "perfectthymetech"
      [32m+[0m[0m delta_sharing_recipient_token_lifetime_in_seconds = 0
      [32m+[0m[0m delta_sharing_scope                               = "INTERNAL"
      [32m+[0m[0m force_destroy                                     = true
      [32m+[0m[0m global_metastore_id                               = (known after apply)
      [32m+[0m[0m id                                                = (known after apply)
      [32m+[0m[0m name                                              = "perfectthymetech-northeurope"
      [32m+[0m[0m owner                                             = "4b9deed4-7d41-48e6-a429-bef3232b7477"
      [32m+[0m[0m region                                            = (known after apply)
      [32m+[0m[0m storage_root                                      = "abfss://mydmgmtdevst001@unitynortheurope.dfs.core.windows.net/"
      [32m+[0m[0m updated_at                                        = (known after apply)
      [32m+[0m[0m updated_by                                        = (known after apply)
    }

[1m  # databricks_metastore_assignment.metastore_assignment[0m will be created
[0m  [32m+[0m[0m resource "databricks_metastore_assignment" "metastore_assignment" {
      [32m+[0m[0m default_catalog_name = "mydmgmt-dev-cnsmptn-dbw001"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m metastore_id         = (known after apply)
      [32m+[0m[0m workspace_id         = 4876486318364527
    }

[1m  # databricks_metastore_data_access.metastore_data_access[0m will be created
[0m  [32m+[0m[0m resource "databricks_metastore_data_access" "metastore_data_access" {
      [32m+[0m[0m configuration_type = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m is_default         = true
      [32m+[0m[0m metastore_id       = (known after apply)
      [32m+[0m[0m name               = "default-data-access"

      [32m+[0m[0m azure_managed_identity {
          [32m+[0m[0m access_connector_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-dbac001"
        }
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>